import { get } from "js-cookie"

class dictData {
	getOrderStatus(val) {
		switch (val) {
			case 0:
				return '故障'
			case 1:
				return '进行中'
			case 2:
				return '已完成'
			case 2:
				return '待结算'
		}
	}

	getBusKindData(){
		return [
			{
				"value": "个体工商户",
				"label": "个体工商户",
				"children": [
				{
					"value": "交通出行/票务旅游",
					"label": "交通出行/票务旅游",
					"children": [
					{
						"value": "100145",
						"label": "旅馆/酒店/度假区",
						"code": "100145"
					},
					{
						"value": "100146",
						"label": "加油",
						"code": "100146"
					},
					{
						"value": "100183",
						"label": "租车",
						"code": "100183"
					},
					{
						"value": "100184",
						"label": "船舶/海运服务",
						"code": "100184"
					},
					{
						"value": "100186",
						"label": "景区",
						"code": "100186"
					}
					]
				},
				{
					"value": "交通运输服务",
					"label": "交通运输服务",
					"children": [
					{
						"value": "100135",
						"label": "汽车用品",
						"code": "100135"
					},
					{
						"value": "100136",
						"label": "汽车美容/维修保养",
						"code": "100136"
					}
					]
				},
				{
					"value": "休闲娱乐",
					"label": "休闲娱乐",
					"children": [
					{
						"value": "100127",
						"label": "娱乐票务",
						"code": "100127"
					},
					{
						"value": "100128",
						"label": "院线影城",
						"code": "100128"
					},
					{
						"value": "100129",
						"label": "演出赛事",
						"code": "100129"
					},
					{
						"value": "100130",
						"label": "运动健身场馆",
						"code": "100130"
					},
					{
						"value": "100131",
						"label": "美发/美容/美甲店",
						"code": "100131"
					},
					{
						"value": "100132",
						"label": "俱乐部/休闲会所",
						"code": "100132"
					},
					{
						"value": "100133",
						"label": "游艺厅/KTV/网吧",
						"code": "100133"
					},
					{
						"value": "100134",
						"label": "酒吧",
						"code": "100134"
					}
					]
				},
				{
					"value": "居民生活/商业服务",
					"label": "居民生活/商业服务",
					"children": [
					{
						"value": "100118",
						"label": "婚庆/摄影",
						"code": "100118"
					},
					{
						"value": "100119",
						"label": "丧仪殡葬服务",
						"code": "100119"
					},
					{
						"value": "100120",
						"label": "搬家/回收",
						"code": "100120"
					},
					{
						"value": "100121",
						"label": "宠物医院",
						"code": "100121"
					},
					{
						"value": "100122",
						"label": "咨询/法律咨询/金融咨询等",
						"code": "100122"
					},
					{
						"value": "100123",
						"label": "装饰/设计",
						"code": "100123"
					},
					{
						"value": "100124",
						"label": "家政/维修服务",
						"code": "100124"
					},
					{
						"value": "100125",
						"label": "广告/会展/活动策划",
						"code": "100125"
					},
					{
						"value": "100126",
						"label": "苗木种植/园林绿化",
						"code": "100126"
					},
					{
						"value": "100182",
						"label": "物流/快递",
						"code": "100182"
					}
					]
				},
				{
					"value": "教育/医疗",
					"label": "教育/医疗",
					"children": [
					{
						"value": "100139",
						"label": "教育/培训/考试缴费/学费",
						"code": "100139"
					},
					{
						"value": "100140",
						"label": "保健器械/医疗器械/非处方药品",
						"code": "100140"
					},
					{
						"value": "100141",
						"label": "私立/民营医院/诊所",
						"code": "100141"
					},
					{
						"value": "100202",
						"label": "教育培训机构",
						"code": "100202"
					},
					{
						"value": "100211",
						"label": "教育培训机构",
						"code": "100211"
					}
					]
				},
				{
					"value": "生活缴费",
					"label": "生活缴费",
					"children": [
					{
						"value": "100142",
						"label": "话费通讯",
						"code": "100142"
					},
					{
						"value": "100143",
						"label": "生活缴费",
						"code": "100143"
					},
					{
						"value": "100185",
						"label": "停车缴费",
						"code": "100185"
					},
					{
						"value": "100194",
						"label": "生活缴费",
						"code": "100194"
					}
					]
				},
				{
					"value": "线下零售",
					"label": "线下零售",
					"children": [
					{
						"value": "100104",
						"label": "便利店",
						"code": "100104"
					},
					{
						"value": "100105",
						"label": "食品生鲜",
						"code": "100105"
					},
					{
						"value": "100106",
						"label": "数码电器/电脑办公",
						"code": "100106"
					},
					{
						"value": "100107",
						"label": "家具建材/家居厨具",
						"code": "100107"
					},
					{
						"value": "100108",
						"label": "服饰箱包",
						"code": "100108"
					},
					{
						"value": "100109",
						"label": "运动户外",
						"code": "100109"
					},
					{
						"value": "100110",
						"label": "美妆个护",
						"code": "100110"
					},
					{
						"value": "100111",
						"label": "母婴用品/儿童玩具",
						"code": "100111"
					},
					{
						"value": "100112",
						"label": "计生用品",
						"code": "100112"
					},
					{
						"value": "100113",
						"label": "图书音像/文具乐器",
						"code": "100113"
					},
					{
						"value": "100114",
						"label": "钟表眼镜",
						"code": "100114"
					},
					{
						"value": "100115",
						"label": "宠物/宠物用品",
						"code": "100115"
					},
					{
						"value": "100116",
						"label": "礼品鲜花/农资绿植",
						"code": "100116"
					},
					{
						"value": "100117",
						"label": "批发业",
						"code": "100117"
					},
					{
						"value": "100178",
						"label": "超市",
						"code": "100178"
					},
					{
						"value": "100179",
						"label": "自动贩卖机",
						"code": "100179"
					},
					{
						"value": "100180",
						"label": "百货",
						"code": "100180"
					},
					{
						"value": "100181",
						"label": "黄金珠宝",
						"code": "100181"
					},
					{
						"value": "100187",
						"label": "非文物类收藏品",
						"code": "100187"
					},
					{
						"value": "100203",
						"label": "超市",
						"code": "100203"
					}
					]
				},
				{
					"value": "网络媒体/计算机服务/游戏",
					"label": "网络媒体/计算机服务/游戏",
					"children": [
					{
						"value": "100137",
						"label": "软件/建站/技术开发",
						"code": "100137"
					},
					{
						"value": "100138",
						"label": "网络推广/网络广告",
						"code": "100138"
					}
					]
				},
				{
					"value": "金融",
					"label": "金融",
					"children": [
					{
						"value": "100144",
						"label": "财经资讯",
						"code": "100144"
					}
					]
				},
				{
					"value": "餐饮",
					"label": "餐饮",
					"children": [
					{
						"value": "100094",
						"label": "快餐",
						"code": "100094"
					},
					{
						"value": "100095",
						"label": "火锅",
						"code": "100095"
					},
					{
						"value": "100096",
						"label": "烧烤",
						"code": "100096"
					},
					{
						"value": "100097",
						"label": "小吃/熟食",
						"code": "100097"
					},
					{
						"value": "100098",
						"label": "其他中餐",
						"code": "100098"
					},
					{
						"value": "100099",
						"label": "日韩/东南亚菜",
						"code": "100099"
					},
					{
						"value": "100100",
						"label": "西餐",
						"code": "100100"
					},
					{
						"value": "100101",
						"label": "咖啡厅",
						"code": "100101"
					},
					{
						"value": "100102",
						"label": "甜品饮品",
						"code": "100102"
					},
					{
						"value": "100103",
						"label": "烘焙糕点",
						"code": "100103"
					}
					]
				}
				]
			},
			{
				"value": "企业",
				"label": "企业",
				"children": [
				{
					"value": "交通出行/票务旅游",
					"label": "交通出行/票务旅游",
					"children": [
					{
						"value": "100052",
						"label": "租车",
						"code": "100052"
					},
					{
						"value": "100053",
						"label": "机票/机票代理",
						"code": "100053"
					},
					{
						"value": "100054",
						"label": "铁路客运",
						"code": "100054"
					},
					{
						"value": "100055",
						"label": "高速收费",
						"code": "100055"
					},
					{
						"value": "100056",
						"label": "城市公共交通",
						"code": "100056"
					},
					{
						"value": "100057",
						"label": "加油",
						"code": "100057"
					},
					{
						"value": "100058",
						"label": "停车缴费",
						"code": "100058"
					},
					{
						"value": "100059",
						"label": "汽车用品",
						"code": "100059"
					},
					{
						"value": "100060",
						"label": "汽车美容/维修保养",
						"code": "100060"
					},
					{
						"value": "100061",
						"label": "船舶/海运服务",
						"code": "100061"
					},
					{
						"value": "100062",
						"label": "景区",
						"code": "100062"
					},
					{
						"value": "100063",
						"label": "旅馆/酒店/度假区",
						"code": "100063"
					},
					{
						"value": "100064",
						"label": "旅行社",
						"code": "100064"
					},
					{
						"value": "100201",
						"label": "城市公共交通",
						"code": "100201"
					}
					]
				},
				{
					"value": "休闲娱乐",
					"label": "休闲娱乐",
					"children": [
					{
						"value": "100044",
						"label": "娱乐票务",
						"code": "100044"
					},
					{
						"value": "100045",
						"label": "院线影城",
						"code": "100045"
					},
					{
						"value": "100046",
						"label": "演出赛事",
						"code": "100046"
					},
					{
						"value": "100047",
						"label": "运动健身场馆",
						"code": "100047"
					},
					{
						"value": "100048",
						"label": "美发/美容/美甲店",
						"code": "100048"
					},
					{
						"value": "100049",
						"label": "俱乐部/休闲会所",
						"code": "100049"
					},
					{
						"value": "100050",
						"label": "游艺厅/KTV/网吧",
						"code": "100050"
					},
					{
						"value": "100051",
						"label": "酒吧",
						"code": "100051"
					}
					]
				},
				{
					"value": "其他",
					"label": "其他",
					"children": [
					{
						"value": "100093",
						"label": "其他行业",
						"code": "100093"
					},
					{
						"value": "100199",
						"label": "其他行业",
						"code": "100199"
					}
					]
				},
				{
					"value": "居民生活/商业服务",
					"label": "居民生活/商业服务",
					"children": [
					{
						"value": "100030",
						"label": "物流/快递公司",
						"code": "100030"
					},
					{
						"value": "100031",
						"label": "家政/维修服务",
						"code": "100031"
					},
					{
						"value": "100032",
						"label": "婚庆/摄影",
						"code": "100032"
					},
					{
						"value": "100033",
						"label": "丧仪殡葬服务",
						"code": "100033"
					},
					{
						"value": "100034",
						"label": "搬家/回收",
						"code": "100034"
					},
					{
						"value": "100035",
						"label": "共享服务",
						"code": "100035"
					},
					{
						"value": "100036",
						"label": "宠物医院",
						"code": "100036"
					},
					{
						"value": "100037",
						"label": "苗木种植/园林绿化",
						"code": "100037"
					},
					{
						"value": "100038",
						"label": "装饰/设计",
						"code": "100038"
					},
					{
						"value": "100039",
						"label": "广告/会展/活动策划",
						"code": "100039"
					},
					{
						"value": "100040",
						"label": "咨询/法律咨询/金融咨询等",
						"code": "100040"
					},
					{
						"value": "100041",
						"label": "人才中介机构/招聘/猎头",
						"code": "100041"
					},
					{
						"value": "100042",
						"label": "职业社交/婚介/交友",
						"code": "100042"
					},
					{
						"value": "100043",
						"label": "房地产",
						"code": "100043"
					}
					]
				},
				{
					"value": "收藏/拍卖",
					"label": "收藏/拍卖",
					"children": [
					{
						"value": "100090",
						"label": "非文物类收藏品",
						"code": "100090"
					},
					{
						"value": "100091",
						"label": "文物经营/文物复制品销售",
						"code": "100091"
					},
					{
						"value": "100092",
						"label": "拍卖/典当",
						"code": "100092"
					}
					]
				},
				{
					"value": "教育/医疗",
					"label": "教育/医疗",
					"children": [
					{
						"value": "100075",
						"label": "教育/培训/考试缴费/学费",
						"code": "100075"
					},
					{
						"value": "100076",
						"label": "保健信息咨询平台",
						"code": "100076"
					},
					{
						"value": "100077",
						"label": "私立/民营医院/诊所",
						"code": "100077"
					},
					{
						"value": "100173",
						"label": "民办中小幼",
						"code": "100173"
					},
					{
						"value": "100192",
						"label": "教育/培训/考试缴费/学费",
						"code": "100192"
					},
					{
						"value": "100197",
						"label": "教育培训机构",
						"code": "100197"
					},
					{
						"value": "100200",
						"label": "民办中小幼",
						"code": "100200"
					},
					{
						"value": "100210",
						"label": "教育培训机构",
						"code": "100210"
					}
					]
				},
				{
					"value": "生活缴费",
					"label": "生活缴费",
					"children": [
					{
						"value": "100078",
						"label": "电信运营商",
						"code": "100078"
					},
					{
						"value": "100079",
						"label": "宽带收费",
						"code": "100079"
					},
					{
						"value": "100080",
						"label": "话费通讯",
						"code": "100080"
					},
					{
						"value": "100081",
						"label": "有线电视缴费",
						"code": "100081"
					},
					{
						"value": "100082",
						"label": "物业管理费",
						"code": "100082"
					},
					{
						"value": "100083",
						"label": "水电煤缴费/交通罚款等生活缴费",
						"code": "100083"
					},
					{
						"value": "100084",
						"label": "其他生活缴费",
						"code": "100084"
					}
					]
				},
				{
					"value": "线下零售",
					"label": "线下零售",
					"children": [
					{
						"value": "100011",
						"label": "超市",
						"code": "100011"
					},
					{
						"value": "100012",
						"label": "便利店",
						"code": "100012"
					},
					{
						"value": "100013",
						"label": "百货",
						"code": "100013"
					},
					{
						"value": "100014",
						"label": "自动贩卖机",
						"code": "100014"
					},
					{
						"value": "100015",
						"label": "食品生鲜",
						"code": "100015"
					},
					{
						"value": "100016",
						"label": "数码电器/电脑办公",
						"code": "100016"
					},
					{
						"value": "100017",
						"label": "家具建材/家居厨具",
						"code": "100017"
					},
					{
						"value": "100018",
						"label": "服饰箱包",
						"code": "100018"
					},
					{
						"value": "100019",
						"label": "运动户外",
						"code": "100019"
					},
					{
						"value": "100020",
						"label": "美妆个护",
						"code": "100020"
					},
					{
						"value": "100021",
						"label": "母婴用品/儿童玩具",
						"code": "100021"
					},
					{
						"value": "100022",
						"label": "计生用品",
						"code": "100022"
					},
					{
						"value": "100023",
						"label": "黄金珠宝",
						"code": "100023"
					},
					{
						"value": "100024",
						"label": "礼品鲜花/农资绿植",
						"code": "100024"
					},
					{
						"value": "100025",
						"label": "宠物/宠物用品",
						"code": "100025"
					},
					{
						"value": "100026",
						"label": "钟表眼镜",
						"code": "100026"
					},
					{
						"value": "100027",
						"label": "批发业",
						"code": "100027"
					},
					{
						"value": "100028",
						"label": "图书音像/文具乐器",
						"code": "100028"
					}
					]
				},
				{
					"value": "网上服务平台",
					"label": "网上服务平台",
					"children": [
					{
						"value": "100071",
						"label": "团购服务平台",
						"code": "100071"
					},
					{
						"value": "100072",
						"label": "综合生活服务平台",
						"code": "100072"
					},
					{
						"value": "100073",
						"label": "旅游服务平台",
						"code": "100073"
					},
					{
						"value": "100074",
						"label": "订餐服务平台",
						"code": "100074"
					}
					]
				},
				{
					"value": "网上购物",
					"label": "网上购物",
					"children": [
					{
						"value": "100029",
						"label": "线上商超",
						"code": "100029"
					}
					]
				},
				{
					"value": "网络媒体/计算机服务/游戏",
					"label": "网络媒体/计算机服务/游戏",
					"children": [
					{
						"value": "100065",
						"label": "在线图书/视频/音乐",
						"code": "100065"
					},
					{
						"value": "100066",
						"label": "门户/资讯/论坛",
						"code": "100066"
					},
					{
						"value": "100067",
						"label": "游戏",
						"code": "100067"
					},
					{
						"value": "100068",
						"label": "网络直播",
						"code": "100068"
					},
					{
						"value": "100069",
						"label": "软件/建站/技术开发",
						"code": "100069"
					},
					{
						"value": "100070",
						"label": "网络推广/网络广告",
						"code": "100070"
					}
					]
				},
				{
					"value": "金融",
					"label": "金融",
					"children": [
					{
						"value": "100085",
						"label": "财经资讯",
						"code": "100085"
					},
					{
						"value": "100086",
						"label": "股票软件类",
						"code": "100086"
					},
					{
						"value": "100087",
						"label": "保险业务",
						"code": "100087"
					},
					{
						"value": "100088",
						"label": "众筹",
						"code": "100088"
					},
					{
						"value": "100089",
						"label": "信用还款",
						"code": "100089"
					}
					]
				},
				{
					"value": "餐饮",
					"label": "餐饮",
					"children": [
					{
						"value": "100001",
						"label": "快餐",
						"code": "100001"
					},
					{
						"value": "100002",
						"label": "火锅",
						"code": "100002"
					},
					{
						"value": "100003",
						"label": "烧烤",
						"code": "100003"
					},
					{
						"value": "100004",
						"label": "小吃/熟食",
						"code": "100004"
					},
					{
						"value": "100005",
						"label": "其他中餐",
						"code": "100005"
					},
					{
						"value": "100006",
						"label": "日韩/东南亚菜",
						"code": "100006"
					},
					{
						"value": "100007",
						"label": "西餐",
						"code": "100007"
					},
					{
						"value": "100008",
						"label": "咖啡厅",
						"code": "100008"
					},
					{
						"value": "100009",
						"label": "甜品饮品",
						"code": "100009"
					},
					{
						"value": "100010",
						"label": "烘焙糕点",
						"code": "100010"
					}
					]
				}
				]
			}
		]
	}

	getBankNo(){
		return [
			{
				"bank_name": "中国工商银行股份有限公司",
				"bank_code": "102100099996"
			},
			{
				"bank_name": "中国农业银行股份有限公司",
				"bank_code": "103100000026"
			},
			{
				"bank_name": "中国银行股份有限公司",
				"bank_code": "104100000004"
			},
			{
				"bank_name": "中国建设银行股份有限公司",
				"bank_code": "105100000017"
			},
			{
				"bank_name": "国家开发银行股份有限公司",
				"bank_code": "201100000017"
			},
			{
				"bank_name": "中国进出口银行",
				"bank_code": "202100000003"
			},
			{
				"bank_name": "中国农业发展银行",
				"bank_code": "203100000019"
			},
			{
				"bank_name": "交通银行股份有限公司",
				"bank_code": "301290000007"
			},
			{
				"bank_name": "中信银行股份有限公司",
				"bank_code": "302100011000"
			},
			{
				"bank_name": "中国光大银行股份有限公司",
				"bank_code": "303100000006"
			},
			{
				"bank_name": "华夏银行股份有限公司",
				"bank_code": "304100040000"
			},
			{
				"bank_name": "中国民生银行股份有限公司",
				"bank_code": "305100000013"
			},
			{
				"bank_name": "广发银行股份有限公司",
				"bank_code": "306581000003"
			},
			{
				"bank_name": "平安银行股份有限公司",
				"bank_code": "307584007998"
			},
			{
				"bank_name": "招商银行股份有限公司",
				"bank_code": "308584000013"
			},
			{
				"bank_name": "兴业银行股份有限公司",
				"bank_code": "309391000011"
			},
			{
				"bank_name": "上海浦东发展银行股份有限公司",
				"bank_code": "310290000013"
			},
			{
				"bank_name": "恒丰银行股份有限公司",
				"bank_code": "315456000105"
			},
			{
				"bank_name": "浙商银行股份有限公司",
				"bank_code": "316331000018"
			},
			{
				"bank_name": "渤海银行股份有限公司",
				"bank_code": "318110000014"
			},
			{
				"bank_name": "中国邮政储蓄银行股份有限公司",
				"bank_code": "403100000004"
			},
			{
				"bank_name": "东亚银行（中国）有限公司",
				"bank_code": "502290000006"
			},
			{
				"bank_name": "南洋商业银行（中国）有限公司",
				"bank_code": "503290000007"
			},
			{
				"bank_name": "中信银行国际（中国）有限公司",
				"bank_code": "514584000002"
			},
			{
				"bank_name": "三菱东京日联银行（中国）有限公司",
				"bank_code": "561290000015"
			},
			{
				"bank_name": "企业银行（中国）有限公司",
				"bank_code": "596110000013"
			},
			{
				"bank_name": "大华银行（中国）有限公司",
				"bank_code": "622290000016"
			},
			{
				"bank_name": "星展银行（中国）有限公司",
				"bank_code": "623290000019"
			},
			{
				"bank_name": "苏格兰皇家银行（中国）有限公司",
				"bank_code": "661290000018"
			},
			{
				"bank_name": "渣打银行（中国）有限公司",
				"bank_code": "671290000017"
			},
			{
				"bank_name": "德意志银行（中国）有限公司",
				"bank_code": "712100000011"
			},
			{
				"bank_name": "蒙特利尔银行（中国）有限公司",
				"bank_code": "752581012131"
			},
			{
				"bank_name": "摩根士丹利国际银行（中国）有限公司",
				"bank_code": "771585000010"
			},
			{
				"bank_name": "宁波通商银行股份有限公司",
				"bank_code": "313332090019"
			},
			{
				"bank_name": "华美银行(中国)有限公司",
				"bank_code": "775290000018"
			},
			{
				"bank_name": "厦门国际银行股份有限公司",
				"bank_code": "781393010011"
			},
			{
				"bank_name": "法国巴黎银行（中国）有限公司",
				"bank_code": "782290000018"
			},
			{
				"bank_name": "富邦华一银行有限公司",
				"bank_code": "787290000019"
			},
			{
				"bank_name": "成都银行股份有限公司",
				"bank_code": "313651099999"
			},
			{
				"bank_name": "攀枝花市商业银行股份有限公司",
				"bank_code": "313656000019"
			},
			{
				"bank_name": "泸州市商业银行股份有限公司",
				"bank_code": "313657092617"
			},
			{
				"bank_name": "宜宾市商业银行股份有限公司",
				"bank_code": "313671000017"
			},
			{
				"bank_name": "乐山市商业银行股份有限公司",
				"bank_code": "313665092924"
			},
			{
				"bank_name": "绵阳市商业银行股份有限公司",
				"bank_code": "313659000016"
			},
			{
				"bank_name": "达州市商业银行股份有限公司",
				"bank_code": "313675090019"
			},
			{
				"bank_name": "雅安市商业银行股份有限公司",
				"bank_code": "313677000010"
			},
			{
				"bank_name": "凉山州商业银行股份有限公司",
				"bank_code": "313684093748"
			},
			{
				"bank_name": "北京银行股份有限公司",
				"bank_code": "313100000013"
			},
			{
				"bank_name": "天津银行股份有限公司",
				"bank_code": "313110000017"
			},
			{
				"bank_name": "徽商银行股份有限公司",
				"bank_code": "319361000013"
			},
			{
				"bank_name": "贵阳银行股份有限公司",
				"bank_code": "313701098010"
			},
			{
				"bank_name": "盛京银行股份有限公司",
				"bank_code": "313221030008"
			},
			{
				"bank_name": "大连银行股份有限公司",
				"bank_code": "313222080002"
			},
			{
				"bank_name": "鞍山银行股份有限公司",
				"bank_code": "313223007007"
			},
			{
				"bank_name": "抚顺银行股份有限公司",
				"bank_code": "313224000015"
			},
			{
				"bank_name": "丹东银行股份有限公司",
				"bank_code": "313226009000"
			},
			{
				"bank_name": "锦州银行股份有限公司",
				"bank_code": "313227000012"
			},
			{
				"bank_name": "营口银行股份有限公司",
				"bank_code": "313228000276"
			},
			{
				"bank_name": "阜新银行股份有限公司",
				"bank_code": "313229000008"
			},
			{
				"bank_name": "辽阳银行股份有限公司",
				"bank_code": "313231000013"
			},
			{
				"bank_name": "铁岭银行股份有限公司",
				"bank_code": "313233000017"
			},
			{
				"bank_name": "朝阳银行股份有限公司",
				"bank_code": "313234001089"
			},
			{
				"bank_name": "葫芦岛银行股份有限公司",
				"bank_code": "313227600018"
			},
			{
				"bank_name": "泉州银行股份有限公司",
				"bank_code": "313397075189"
			},
			{
				"bank_name": "厦门银行股份有限公司",
				"bank_code": "313393080005"
			},
			{
				"bank_name": "兰州银行股份有限公司",
				"bank_code": "313821001016"
			},
			{
				"bank_name": "广州银行股份有限公司",
				"bank_code": "313581003284"
			},
			{
				"bank_name": "珠海华润银行股份有限公司",
				"bank_code": "313585000990"
			},
			{
				"bank_name": "广东南粤银行股份有限公司",
				"bank_code": "313591001001"
			},
			{
				"bank_name": "东莞银行股份有限公司",
				"bank_code": "313602088017"
			},
			{
				"bank_name": "广西北部湾银行股份有限公司",
				"bank_code": "313611001018"
			},
			{
				"bank_name": "沧州银行股份有限公司",
				"bank_code": "313143005157"
			},
			{
				"bank_name": "廊坊银行股份有限公司",
				"bank_code": "313146000019"
			},
			{
				"bank_name": "衡水银行股份有限公司",
				"bank_code": "313148053964"
			},
			{
				"bank_name": "焦作中旅银行股份有限公司",
				"bank_code": "313501080608"
			},
			{
				"bank_name": "洛阳银行股份有限公司",
				"bank_code": "313493080539"
			},
			{
				"bank_name": "郑州银行股份有限公司",
				"bank_code": "313491000232"
			},
			{
				"bank_name": "哈尔滨银行股份有限公司",
				"bank_code": "313261000018"
			},
			{
				"bank_name": "汉口银行股份有限公司",
				"bank_code": "313521000011"
			},
			{
				"bank_name": "长沙银行股份有限公司",
				"bank_code": "313551088886"
			},
			{
				"bank_name": "吉林银行股份有限公司",
				"bank_code": "313241066661"
			},
			{
				"bank_name": "江苏银行股份有限公司",
				"bank_code": "313301099999"
			},
			{
				"bank_name": "南京银行股份有限公司",
				"bank_code": "313301008887"
			},
			{
				"bank_name": "江苏长江商业银行股份有限公司",
				"bank_code": "313312300018"
			},
			{
				"bank_name": "九江银行股份有限公司",
				"bank_code": "313424076706"
			},
			{
				"bank_name": "上饶银行股份有限公司",
				"bank_code": "313433076801"
			},
			{
				"bank_name": "赣州银行股份有限公司",
				"bank_code": "313428076517"
			},
			{
				"bank_name": "江西银行股份有限公司",
				"bank_code": "313421087506"
			},
			{
				"bank_name": "内蒙古银行股份有限公司",
				"bank_code": "313191000011"
			},
			{
				"bank_name": "包商银行股份有限公司",
				"bank_code": "313192000013"
			},
			{
				"bank_name": "乌海银行股份有限公司",
				"bank_code": "313193057846"
			},
			{
				"bank_name": "鄂尔多斯银行股份有限公司",
				"bank_code": "313205057830"
			},
			{
				"bank_name": "宁夏银行股份有限公司",
				"bank_code": "313871000007"
			},
			{
				"bank_name": "齐鲁银行股份有限公司",
				"bank_code": "313451000019"
			},
			{
				"bank_name": "青岛银行股份有限公司",
				"bank_code": "313452060150"
			},
			{
				"bank_name": "齐商银行股份有限公司",
				"bank_code": "313453001017"
			},
			{
				"bank_name": "河北银行股份有限公司",
				"bank_code": "313121006888"
			},
			{
				"bank_name": "唐山银行股份有限公司",
				"bank_code": "313124000018"
			},
			{
				"bank_name": "秦皇岛银行股份有限公司",
				"bank_code": "313126001022"
			},
			{
				"bank_name": "邯郸银行股份有限公司",
				"bank_code": "313127000013"
			},
			{
				"bank_name": "邢台银行股份有限公司",
				"bank_code": "313131000016"
			},
			{
				"bank_name": "保定银行股份有限公司",
				"bank_code": "313134000011"
			},
			{
				"bank_name": "承德银行股份有限公司",
				"bank_code": "313141052422"
			},
			{
				"bank_name": "枣庄银行股份有限公司",
				"bank_code": "313454000016"
			},
			{
				"bank_name": "东营银行股份有限公司",
				"bank_code": "313455000018"
			},
			{
				"bank_name": "烟台银行股份有限公司",
				"bank_code": "313456000108"
			},
			{
				"bank_name": "潍坊银行股份有限公司",
				"bank_code": "313458000013"
			},
			{
				"bank_name": "济宁银行股份有限公司",
				"bank_code": "313461000012"
			},
			{
				"bank_name": "威海市商业银行股份有限公司",
				"bank_code": "313465000010"
			},
			{
				"bank_name": "日照银行股份有限公司",
				"bank_code": "313473200011"
			},
			{
				"bank_name": "莱商银行股份有限公司",
				"bank_code": "313463400019"
			},
			{
				"bank_name": "临商银行股份有限公司",
				"bank_code": "313473070018"
			},
			{
				"bank_name": "晋商银行股份有限公司",
				"bank_code": "313161000017"
			},
			{
				"bank_name": "大同银行股份有限公司",
				"bank_code": "313162055820"
			},
			{
				"bank_name": "阳泉市商业银行股份有限公司",
				"bank_code": "313163000004"
			},
			{
				"bank_name": "晋城银行股份有限公司",
				"bank_code": "313168000003"
			},
			{
				"bank_name": "长治银行股份有限公司",
				"bank_code": "313164000006"
			},
			{
				"bank_name": "晋中银行股份有限公司",
				"bank_code": "313175000011"
			},
			{
				"bank_name": "长安银行股份有限公司",
				"bank_code": "313791030003"
			},
			{
				"bank_name": "西安银行股份有限公司",
				"bank_code": "313791000015"
			},
			{
				"bank_name": "上海银行股份有限公司",
				"bank_code": "325290000012"
			},
			{
				"bank_name": "新疆汇和银行股份有限公司",
				"bank_code": "313898100016"
			},
			{
				"bank_name": "富滇银行股份有限公司",
				"bank_code": "313731010015"
			},
			{
				"bank_name": "曲靖市商业银行股份有限公司",
				"bank_code": "313736000019"
			},
			{
				"bank_name": "杭州银行股份有限公司",
				"bank_code": "313331000014"
			},
			{
				"bank_name": "宁波银行股份有限公司",
				"bank_code": "313332082914"
			},
			{
				"bank_name": "温州银行股份有限公司",
				"bank_code": "313333007331"
			},
			{
				"bank_name": "嘉兴银行股份有限公司",
				"bank_code": "313335081005"
			},
			{
				"bank_name": "湖州银行股份有限公司",
				"bank_code": "313336071575"
			},
			{
				"bank_name": "绍兴银行股份有限公司",
				"bank_code": "313337009004"
			},
			{
				"bank_name": "金华银行股份有限公司",
				"bank_code": "313338009688"
			},
			{
				"bank_name": "浙江稠州商业银行股份有限公司",
				"bank_code": "313338707013"
			},
			{
				"bank_name": "台州银行股份有限公司",
				"bank_code": "313345001665"
			},
			{
				"bank_name": "浙江泰隆商业银行股份有限公司",
				"bank_code": "313345010019"
			},
			{
				"bank_name": "浙江民泰商业银行股份有限公司",
				"bank_code": "313345400010"
			},
			{
				"bank_name": "重庆银行股份有限公司",
				"bank_code": "313653000013"
			},
			{
				"bank_name": "重庆三峡银行股份有限公司",
				"bank_code": "321667090019"
			},
			{
				"bank_name": "青海银行股份有限公司",
				"bank_code": "313851000018"
			},
			{
				"bank_name": "河南方城凤裕村镇银行有限责任公司",
				"bank_code": "320513400012"
			},
			{
				"bank_name": "青岛胶南海汇村镇银行股份有限公司",
				"bank_code": "320452200015"
			},
			{
				"bank_name": "北京农村商业银行股份有限公司",
				"bank_code": "402100000018"
			},
			{
				"bank_name": "天津农村商业银行股份有限公司",
				"bank_code": "317110010019"
			},
			{
				"bank_name": "天津滨海农村商业银行股份有限公司",
				"bank_code": "314110000011"
			},
			{
				"bank_name": "深圳农村商业银行股份有限公司",
				"bank_code": "402584009991"
			},
			{
				"bank_name": "武汉农村商业银行股份有限公司",
				"bank_code": "402521090019"
			},
			{
				"bank_name": "无锡农村商业银行股份有限公司",
				"bank_code": "314302066666"
			},
			{
				"bank_name": "江苏江阴农村商业银行股份有限公司",
				"bank_code": "314302200018"
			},
			{
				"bank_name": "苏州银行股份有限公司",
				"bank_code": "313305066661"
			},
			{
				"bank_name": "江苏常熟农村商业银行股份有限公司",
				"bank_code": "314305506621"
			},
			{
				"bank_name": "江苏太仓农村商业银行股份有限公司",
				"bank_code": "314305106644"
			},
			{
				"bank_name": "宁夏黄河农村商业银行股份有限公司",
				"bank_code": "402871099996"
			},
			{
				"bank_name": "上海农村商业银行股份有限公司",
				"bank_code": "322290000011"
			},
			{
				"bank_name": "重庆农村商业银行股份有限公司",
				"bank_code": "314653000011"
			},
			{
				"bank_name": "江苏江南农村商业银行股份有限公司",
				"bank_code": "314304099999"
			},
			{
				"bank_name": "龙江银行股份有限公司",
				"bank_code": "313261099913"
			},
			{
				"bank_name": "中德住房储蓄银行有限责任公司",
				"bank_code": "717110000010"
			},
			{
				"bank_name": "广州农村商业银行股份有限公司",
				"bank_code": "314581000011"
			},
			{
				"bank_name": "广东顺德农村商业银行股份有限公司",
				"bank_code": "314588000016"
			},
			{
				"bank_name": "东莞农村商业银行股份有限公司",
				"bank_code": "402602000018"
			},
			{
				"bank_name": "深圳福田银座村镇银行股份有限公司",
				"bank_code": "320584002002"
			},
			{
				"bank_name": "华融湘江银行股份有限公司",
				"bank_code": "313551070008"
			},
			{
				"bank_name": "昆仑银行股份有限公司",
				"bank_code": "313882000012"
			},
			{
				"bank_name": "首都银行（中国）有限公司",
				"bank_code": "616301000015"
			},
			{
				"bank_name": "柳州银行股份有限公司",
				"bank_code": "313614000012"
			},
			{
				"bank_name": "外换银行（中国）有限公司",
				"bank_code": "591110000016"
			},
			{
				"bank_name": "桂林银行股份有限公司",
				"bank_code": "313617000018"
			},
			{
				"bank_name": "平顶山银行股份有限公司",
				"bank_code": "313495081900"
			},
			{
				"bank_name": "营口沿海银行股份有限公司",
				"bank_code": "313228060009"
			},
			{
				"bank_name": "本溪市商业银行股份有限公司",
				"bank_code": "313225000017"
			},
			{
				"bank_name": "江西赣州银座村镇银行股份有限公司",
				"bank_code": "320428090311"
			},
			{
				"bank_name": "北京顺义银座村镇银行股份有限公司",
				"bank_code": "320100010011"
			},
			{
				"bank_name": "湖北银行股份有限公司",
				"bank_code": "313521006000"
			},
			{
				"bank_name": "东营莱商村镇银行股份有限公司",
				"bank_code": "320455000019"
			},
			{
				"bank_name": "德州银行股份有限公司",
				"bank_code": "313468000015"
			},
			{
				"bank_name": "广东华兴银行股份有限公司",
				"bank_code": "313586000006"
			},
			{
				"bank_name": "重庆黔江银座村镇银行股份有限公司",
				"bank_code": "320687000016"
			},
			{
				"bank_name": "重庆渝北银座村镇银行股份有限公司",
				"bank_code": "320653000104"
			},
			{
				"bank_name": "临沂河东齐商村镇银行股份有限公司",
				"bank_code": "320473000014"
			},
			{
				"bank_name": "甘肃银行股份有限公司",
				"bank_code": "313821050016"
			},
			{
				"bank_name": "章丘齐鲁村镇银行股份有限公司",
				"bank_code": "320451000011"
			},
			{
				"bank_name": "浙江景宁银座村镇银行股份有限公司",
				"bank_code": "320343800019"
			},
			{
				"bank_name": "宁波东海银行股份有限公司",
				"bank_code": "313332040018"
			},
			{
				"bank_name": "西藏银行股份有限公司",
				"bank_code": "313770000016"
			},
			{
				"bank_name": "济宁高新村镇银行股份有限公司",
				"bank_code": "320461000015"
			},
			{
				"bank_name": "国民银行（中国）有限公司",
				"bank_code": "598100000016"
			},
			{
				"bank_name": "济宁儒商村镇银行股份有限公司",
				"bank_code": "320461010002"
			},
			{
				"bank_name": "贵州银行股份有限公司",
				"bank_code": "313701099012"
			},
			{
				"bank_name": "海口联合农村商业银行股份有限公司",
				"bank_code": "314641000014"
			},
			{
				"bank_name": "天津武清村镇银行股份有限公司",
				"bank_code": "320110000085"
			},
			{
				"bank_name": "哈密市商业银行股份有限公司",
				"bank_code": "313884000016"
			},
			{
				"bank_name": "成都农村商业银行股份有限公司",
				"bank_code": "314651000000"
			},
			{
				"bank_name": "浙江三门银座村镇银行股份有限公司",
				"bank_code": "320345790018"
			},
			{
				"bank_name": "五台莱商村镇银行股份有限公司",
				"bank_code": "320171300016"
			},
			{
				"bank_name": "中原银行股份有限公司",
				"bank_code": "313491099996"
			},
			{
				"bank_name": "深圳前海微众银行股份有限公司",
				"bank_code": "323584000888"
			},
			{
				"bank_name": "上海华瑞银行股份有限公司",
				"bank_code": "323290000016"
			},
			{
				"bank_name": "温州民商银行股份有限公司",
				"bank_code": "323333000013"
			},
			{
				"bank_name": "浙江网商银行股份有限公司",
				"bank_code": "323331000001"
			},
			{
				"bank_name": "泰安银行股份有限公司",
				"bank_code": "313463000993"
			},
			{
				"bank_name": "重庆富民银行股份有限公司",
				"bank_code": "323653010015"
			},
			{
				"bank_name": "威海蓝海银行股份有限公司",
				"bank_code": "323465000019"
			},
			{
				"bank_name": "安徽省农村信用社联合社",
				"bank_code": "402361018886"
			},
			{
				"bank_name": "河北省农村信用社联合社",
				"bank_code": "402121000009"
			},
			{
				"bank_name": "内蒙古自治区农村信用社联合社",
				"bank_code": "402191009992"
			},
			{
				"bank_name": "江西省农村信用社联合社",
				"bank_code": "402421099990"
			},
			{
				"bank_name": "四川省农村信用社联合社",
				"bank_code": "402651020006"
			},
			{
				"bank_name": "贵州省农村信用社联合社",
				"bank_code": "402701002999"
			},
			{
				"bank_name": "辽宁省农村信用社联合社",
				"bank_code": "402221010013"
			},
			{
				"bank_name": "福建省农村信用社联合社",
				"bank_code": "402391000068"
			},
			{
				"bank_name": "广东省农村信用社联合社",
				"bank_code": "402581090008"
			},
			{
				"bank_name": "广西壮族自治区农村信用社联合社",
				"bank_code": "402611099974"
			},
			{
				"bank_name": "海南省农村信用社联合社",
				"bank_code": "402641000014"
			},
			{
				"bank_name": "河南省农村信用社联合社",
				"bank_code": "402491000026"
			},
			{
				"bank_name": "湖北省农村信用社联合社",
				"bank_code": "402521000032"
			},
			{
				"bank_name": "湖南省农村信用社联合社",
				"bank_code": "402551080008"
			},
			{
				"bank_name": "吉林省农村信用社联合社",
				"bank_code": "402241000015"
			},
			{
				"bank_name": "江苏省农村信用社联合社",
				"bank_code": "402301099998"
			},
			{
				"bank_name": "山东省农村信用社联合社",
				"bank_code": "402451000010"
			},
			{
				"bank_name": "山西省农村信用社联合社",
				"bank_code": "402161002352"
			},
			{
				"bank_name": "陕西省农村信用社联合社",
				"bank_code": "402791000010"
			},
			{
				"bank_name": "云南省农村信用社联合社",
				"bank_code": "402731057238"
			},
			{
				"bank_name": "浙江省农村信用社联合社",
				"bank_code": "402331000007"
			}
		]
	}
}
export default new dictData()
